{
    "proyectos":[
        {
            "nombre": "m1l0_j05 WebSite",
            "resumen": "El proyecto consiste en el diseño de una plataforma online personal y de código abierto, cuyo desarrollo está enfocado en el aprendizaje y la profundización en el desarrollo y programación, especialmente en Python y su nuevo framework. La plataforma servirá como un escaparate para mostrar mi evolución y proyectos, funcionando a la vez como un portafolio interactivo. Todo el frontend y los elementos multimedia son creados de manera original, reflejando mi crecimiento en las áreas de diseño y desarrollo web.",
            "descripcion": "Este proyecto se centra en la creación de una plataforma online propia, con un enfoque particular en el aprendizaje continuo y la adquisición de conocimientos avanzados en programación. La decisión de hacer el proyecto de código abierto subraya un compromiso con la colaboración y el aprendizaje compartido dentro de la comunidad de desarrollo. El objetivo principal es sumergirme profundamente en el ecosistema de Python, explorando y dominando su nuevo framework. Este enfoque no solo me permitirá estar al día con las últimas tendencias y prácticas en el desarrollo de software sino también aplicar estos conocimientos en la creación de una plataforma robusta y versátil. Al mismo tiempo, deseo explorar otros aspectos del desarrollo web, incluidos el diseño frontend y la creación de elementos multimedia, asegurando que la plataforma sea tanto funcional como visualmente atractiva. La plataforma funcionará como un portafolio en línea, donde podré mostrar mis proyectos y mi evolución como desarrollador y diseñador. Este enfoque práctico me permitirá documentar mi progreso, desafíos y soluciones, proporcionando un recurso valioso tanto para mi autoevaluación como para otros que puedan estar interesados en seguir una ruta similar en el aprendizaje del desarrollo y programación. Además de servir como un diario de aprendizaje, la plataforma está diseñada de forma que permitia los visitantes explorar mis proyectos, obtener una vision interna sobre el proceso de desarrollo y posiblemente contribuir o aprender a través del código compartido. La naturaleza de código abierto del proyecto invita a la colaboración, permitiendo a otros desarrolladores sugerir mejoras, usar el código para sus propios proyectos de aprendizaje o incluso contribuir con sus propias experiencias y conocimientos. Este proyecto es, por tanto, un paso significativo en mi camino hacia el dominio del desarrollo y programación, ofreciendo una base sólida no solo para el aprendizaje personal sino también para la contribución a la comunidad de código abierto.",
            "tecnologias": ["Python"],
            "url": "https://www.milo-jos.es",
            "imagen": "/images/projects/my_web.webp",
            "fecha_inicio": "2023-12-01",
            "fecha_fin": "En desarrollo"
        },        
        {
            "nombre": "Hermes",
            "resumen": "Herramienta versátil que interactúa directamente con la API de Inoreader para extraer datos de feeds configurados previamente por el usuario. Tras la extracción, esta solución procesa el contenido eliminando el marcado HTML y normalizando el texto para su posterior clasificación según criterios específicos. La herramienta está diseñada para generar mensajes personalizados para ser enviados a través de la API de Telegram, culminando con la creación de un documento en formato PDF. Este documento sirve como un pseudo-periódico personalizado, permitiendo a los usuarios disfrutar de un resumen informativo adaptado a sus intereses y necesidades.",
            "descripcion": "Esta herramienta representa un avance significativo en la personalización y automatización de la recopilación de noticias e información a partir de feeds RSS. Al utilizar la API de Inoreader, esta solución permite a los usuarios seleccionar y configurar previamente feeds de su interés para luego automatizar la extracción de datos relevantes de estos canales.El proceso comienza con la extracción de contenidos de los feeds, tras lo cual un sistema de procesamiento de texto entra en acción. Este sistema elimina cualquier marcado HTML innecesario y normaliza el texto para garantizar una lectura clara y coherente. Posteriormente, el contenido es clasificado según criterios establecidos por el usuario, lo que permite una organización meticulosa de la información según temas, relevancia o cualquier otro parámetro definido. Una vez clasificado el contenido, la herramienta utiliza la API de Telegram para crear y enviar mensajes personalizados. Este paso transforma la manera en que los usuarios reciben y consumen información, permitiéndoles estar al tanto de las últimas noticias y actualizaciones directamente a través de Telegram.El último paso del proceso es la generación de un documento en formato PDF, diseñado como un pseudo-periódico personalizado. Este documento no solo ofrece una visión general de los temas de interés para el usuario final sino que también se presenta como una solución elegante para aquellos que prefieren un formato consolidado y fácil de compartir para su lectura informativa. En resumen, esta herramienta no solo mejora la eficiencia en la gestión de información digital sino que también personaliza la experiencia de consumo de noticias, adaptándola a las preferencias y necesidades individuales de cada usuario.",
            "tecnologias": ["docker","python"],
            "url": "",
            "imagen": "/images/projects/hermes.webp",
            "fecha_inicio": "2024-02-01",
            "fecha_fin": "En Desarrollo"
        },
        {
            "nombre": "Ares",
            "resumen": "Aplicación web autohospedada y sin acceso a internet, diseñada para funcionar en una red interna, especializada en reconocimiento facial avanzado y con una robusta gestión de usuarios para un acceso seguro y segmentado. Esta herramienta integra tecnologías de vanguardia para crear, gestionar y explotar una base de datos de reconocimiento facial, permitiendo comparaciones precisas de imágenes individuales y grupales. Capaz de procesar lotes de fotografías y extraer rostros de videos, genera documentos descargables que destacan la imagen original, la cara buscada y las ocho coincidencias más similares en la base de datos, ordenadas por similitud.",
            "descripcion": "Aplicación web diseñada para operar de manera autohospedada y aislada de Internet en una red interna, es una solución integral en el campo del reconocimiento facial. Esta plataforma no solo combina tecnologías para la identificación facial, sino que también incorpora un sistema de gestión de usuarios, asegurando un acceso seguro y segmentado a la aplicación y a los datos contenidos. Esto permite a diferentes usuarios y roles acceder a funcionalidades específicas, manteniendo al mismo tiempo la integridad y la seguridad de los datos.Con la capacidad de realizar comparaciones detalladas de imágenes, tanto de individuos como de grupos, y procesar lotes de fotografías y videos para extraer rostros, la aplicación se destaca por su versatilidad y precisión. Tras la comparación, genera un documento descargable que muestra la imagen original, el área de interés y las ocho coincidencias más similares de la base de datos, proporcionando una herramienta poderosa para la seguridad, gestión de identidades y otras aplicaciones que requieran reconocimiento facial.La inclusión de una gestión de usuarios refuerza la seguridad y la personalización de la experiencia, permitiendo a las organizaciones controlar el acceso a la información sensible y las funcionalidades de la aplicación de manera efectiva. Esto, combinado con su capacidad de funcionamiento autohospedado y sin conexión a Internet, hace de nuestra aplicación una solución segura, privada y extremadamente útil para el análisis facial avanzado, adaptándose a las necesidades específicas de cada usuario y organización.",
            "tecnologias": ["Docker", "Nginx", "MySQL",  "Python", "Django","JavaScript", "HTML5", "CSS3", "bootstrap"],
            "url": "",
            "imagen": "/images/projects/ares.webp",
            "fecha_inicio": "2019-08-01",
            "fecha_fin": "En Produccion"
        },
        {
            "nombre": "Babel",
            "resumen": "Herramienta avanzada de transcripción autónoma, implementada en una red interna sin acceso a Internet, que aprovecha la tecnología de OpenAI, Whisper, para convertir eficazmente el contenido de audio y video en texto preciso. Incorpora una gestión de usuarios para el acceso seguro y segmentado, mejorando la seguridad y privacidad. Esta solución no solo transcribe sino que también identifica y separa archivos sin contenido auditivo, asegurando una gestión eficiente de archivos. Los usuarios reciben documentos listos para usarse como lectura o subtitulado, con opciones de almacenamiento temporal y eliminación personalizada, resaltando el enfoque en la privacidad y el control total de datos.",
            "descripcion": "Desarrollada para operar de manera completamente autohospedada en una red interna sin necesidad de conexión a Internet, nuestra herramienta representa un avance significativo en la transcripción de audio y video, reforzada con un sistema de gestión de usuarios para asegurar un acceso seguro y segmentado a la aplicación y sus datos. Utilizando el poder de Whisper de OpenAI, ofrece transcripciones precisas y de alta calidad de manera segura y privada. Diseñada para procesar lotes de archivos, distingue automáticamente entre aquellos con y sin contenido auditivo, optimizando el proceso de transcripción mientras garantiza la seguridad de los datos. La inclusión de la gestión de usuarios enfatiza la seguridad y la personalización, permitiendo a diferentes niveles de usuarios acceder a funcionalidades específicas sin comprometer la integridad de los datos. Esto, junto con el almacenamiento temporal de documentos y audios y la opción de eliminación personalizada, proporciona un control completo sobre la información, haciéndola ideal para la transcripción precisa de audio o video a texto en un entorno controlado y seguro. Con una interfaz sencilla y un proceso de trabajo eficiente, esta solución autónoma garantiza resultados de alta calidad, mejorando la accesibilidad y comprensión del contenido mientras mantiene la privacidad y seguridad de los datos.",
            "tecnologias": ["Docker", "Nginx", "MySQL",  "Python", "Django","JavaScript", "HTML5", "CSS3", "bootstrap"],
            "url": "",
            "imagen": "/images/projects/babel.webp",
            "fecha_inicio": "2022-10-01",
            "fecha_fin": "En Produccion"
        },
        {
            "nombre": "Onuris",
            "resumen": "Herramienta web diseñada para automatizar y mejorar la gestión de informes operativos. Al cargar un informe, nuestra solución identifica automáticamente entidades de interés, las compara con una base de datos existente y genera un informe en formato CSV. Este informe puede ser fácilmente integrado en sistemas de terceros, facilitando la vinculación de entidades sin la necesidad de intervención manual, optimizando así los procesos operativos y de análisis. ",
            "descripcion": "La herramienta web está diseñada para transformar la forma en que las se manejan y procesan informes operativos. Al cargar un informe operativo en la plataforma, esta herramienta emplea lógica avanzada para analizar el texto y extraer entidades de interés relevantes, como nombres de personas, organizaciones, ubicaciones y otros términos específicos del dominio. Una vez identificadas las entidades, el sistema procede a compararlas con una base de datos preexistente para encontrar coincidencias o relaciones relevantes. Esta comparación permite no solo identificar las entidades mencionadas en el informe sino también la generación de un informe en formato CSV. Este informe está estructurado para ser compatible con sistemas de terceros, permitiendo una integración fluida. La generación automática de este informe elimina la necesidad de que el personal dedique horas a la tarea manual de vinculación de entidades, lo que reduce significativamente el tiempo y el esfuerzo requerido en el análisis de datos y la gestión de informes. Esta herramienta web no solo mejora la eficiencia operativa sino que también asegura que las vinculaciones entre entidades sean precisas y basadas en datos confiables. Está diseñada para ser utilizada por analistas de datos y agentes operativos, ofreciendo una solución que simplifica significativamente los procesos de análisis y gestión de informes.",
            "tecnologias": ["Docker", "Nginx", "MySQL",  "Python", "Django","JavaScript", "HTML5", "CSS3", "bootstrap"],
            "url": "",
            "imagen": "/images/projects/onuris.webp",
            "fecha_inicio": "2023-02-01",
            "fecha_fin": "En Produccion"
        },
        {
            "nombre": "Prometeo",
            "resumen": "Proyecto que introduce una solución de comunicación y gestión de tareas autohospedada mediante Mattermost, con el plugin Boards para una organización eficaz del trabajo, todo operando en una red interna. Su objetivo es transformar las prácticas de comunicación y coordinación de tareas, pasando de correos electrónicos y herramientas como Excel a un sistema unificado que permite interacciones en tiempo real y gestión de proyectos por equipos, mejorando la eficiencia y la colaboración interna.",
            "descripcion": "El proyecto se centra en la personalización y autohospedaje de Mattermost, una plataforma de comunicaciones, complementada con el uso del plugin Boards para una gestión de tareas efectiva y organizada. Esta solución se despliega en una red interna segura, garantizando la privacidad y la independencia de conexiones externas a internet, lo que es crucial para organizaciones que valoran la seguridad de sus datos y comunicaciones. Al reemplazar el correo electrónico y las herramientas de gestión de proyectos basadas en hojas de cálculo, como Excel, por una plataforma unificada que soporta la comunicación instantánea y la colaboración en equipo, el proyecto busca revolucionar la forma en que los equipos interactúan y gestionan sus tareas. Con la implementación de canales y equipos específicos dentro de Mattermost, cada grupo de trabajo puede organizar sus discusiones, archivos y tareas de manera eficiente, promoviendo una colaboración más efectiva y una gestión del tiempo optimizada. La adición de Boards facilita aún más la visualización de proyectos y tareas, permitiendo a los equipos planificar, ejecutar y monitorear sus trabajos en tiempo real, con una claridad y organización superior. Este enfoque integrado y modernizado promete mejorar significativamente la productividad, la coordinación entre equipos y la gestión de proyectos dentro de la organización.",
            "tecnologias": ["docker"],
            "url": "/images/project.jpg",
            "imagen": "/images/projects/prometeo.webp",
            "fecha_inicio": "2023-05-01",
            "fecha_fin": "En Produccion"
        },
        {
            "nombre": "Portal Corporativo (SelfHosted)",
            "resumen": "Portal web corporativo autohospedado con enlaces a recursos utilizados por los empleados. Incluye gestión de usuarios y áreas de acceso restringido para la gestión de personal y control de material informático.",
            "descripcion": "Desarrollo de un portal web corporativo autohospedado que proporciona acceso a recursos comunes utilizados por los empleados. El portal está desplegado en una máquina Debian y se administra utilizando Docker para la gestión de contenedores. El ecosistema consta de tres contenedores: uno para Nginx como servidor web, otro para Django como el framework de la aplicación web y un tercero para MySQL como el sistema de gestión de bases de datos. Nginx se encarga del enrutamiento y la gestión de solicitudes HTTP. El sistema incluye un sistema de gestión de usuarios que permite el acceso basado en roles. Los usuarios autenticados pueden acceder a áreas restringidas para gestionar y consultar información sobre el personal de la empresa, así como para el control y gestión del material informático.",
            "tecnologias": ["Docker", "Nginx", "MySQL",  "Python", "Django","JavaScript", "HTML5", "CSS3", "bootstrap"],
            "url": "",
            "imagen": "/images/projects/portal_web.webp",
            "fecha_inicio": "2020-01-01",
            "fecha_fin": "En Produccion"
        }
    ]
}
